{
  "id" : 6214,
  "title" : "Adaptation of RFC 1149 for IPv6",
  "informations" : {
    "category" : "INFORMATIONAL",
    "date" : {
      "text" : "1 April 2011",
      "datetime" : "2011-04-01"
    },
    "submitter" : "Network Working Group",
    "updatedBy" : [2549,6214],
    "updates" : null,
    "linkedWith" : [6214]
  },
  "content" : {
    "status" : "This memo defines an Experimental Protocol for the Internet community.  It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
    "copyrightNotice": "Copyright (C) The Internet Society (1999).  All Rights Reserved.",
    "abstract" : "<p>This memo amends <a>RFC 1149, \"A Standard for the Transmission of IP Datagrams on Avian Carriers\"</a>, with Quality of Service information. This is an experimental, not recommended standard.</p>",
    "overviewAndRational" : "<p>The following quality of service levels are available: Concorde, First, Business, and Coach. Concorde class offers expedited data delivery.  One major benefit to using Avian Carriers is that this is the only networking technology that earns frequent flyer miles, plus the Concorde and First classes of service earn 50% bonus miles per packet.  Ostriches are an alternate carrier that have much greater bulk transfer capability but provide slower delivery, and require the use of bridges between domains.</p><p>The service level is indicated on a per-carrier basis by bar-code markings on the wing.  One implementation strategy is for a bar-code reader to scan each carrier as it enters the router and then enqueue it in the proper queue, gated to prevent exit until the proper time. The carriers may sleep while enqueued.</p><p>For secure networks, carriers may have classes Prime or Choice. Prime carriers are self-keying when using public key encryption. Some distributors have been known to falsely classify Choice carriers as Prime.</p><p>Packets MAY be marked for deletion using RED paint while enqueued.</p>",
    "frameFormat" : "<p>The IP datagram is printed, on a small scroll of paper, in hexadecimal, with each octet separated by whitestuff and blackstuff. The scroll of paper is wrapped around one leg of the avian carrier. A band of duct tape is used to secure the datagram's edges. The bandwidth is limited to the leg length. The <abbr title=\"Maximum Transfer Unit\">MTU</abbr> is variable, and paradoxically, generally increases with increased carrier age. A typical MTU is 256 milligrams. Some datagram padding may be needed.</p><p>Upon receipt, the duct tape is removed and the paper copy of the datagram is optically scanned into a electronically transmittable form.</p>",
    "discussion" : "<p>Multiple types of service can be provided with a prioritized pecking order.  An additional property is built-in worm detection and eradication.  Because IP only guarantees best effort delivery, loss of a carrier can be tolerated.  With time, the carriers are self-regenerating.  While broadcasting is not specified, storms can cause data loss.  There is persistent delivery retry, until the carrier drops.  Audit trails are automatically generated, and can often be found on logs and cable trays.</p>",
    "securityConsideration" : "<p>Security is not generally a problem in normal operation, but special measures must be taken (such as data encryption) when avian carriers are used in a tactical environment.</p>"
  },
  "author" : [
    {
      "firstName": "Brian",
      "lastName": "Carpenter",
      "company": "University of Auckland",
      "laboratory": "Department of Computer Science",
      "address": "Auckland, 1142 New Zealand",
      "phone": null,
      "email": "brian.e.carpenter@gmail.com"
    },
    {
      "firstName" : "Robert",
      "lastName" : "Hinden",
      "company" : "Check Point Software Technologies, Inc.",
      "laboratory" : null,
      "address" : "800 Bridge Parkway Redwood City, CA 94065 US",
      "phone" : "+1.650.387.6118",
      "email" : "bob.hinden@gmail.com"
    }
  ]
}